[
  {
    "title": "Thailand releases 18 Cambodian soldiers as ceasefire holds - Al Jazeera",
    "description": "Thailand hands over 18 soldiers after 155 days of captivity as truce agreed over the weekend continues to hold.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2025/12/AP25365153696099-1767157848.jpg?resize=1920%2C1367"
  },
  {
    "title": "Tensions between Saudi Arabia and UAE spike with bombing of port - The Washington Post",
    "description": "The Saudi strike in Yemen on an alleged weapons shipment from the UAE marked an unprecedented escalation of friction between the rival Persian Gulf powers.",
    "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MWFH6QFL44WBU6RHMHSYCQORHA.jpg&w=1440"
  },
  {
    "title": "Former US Sen. Ben Nighthorse Campbell, of Colorado, dies at 92 - Politico",
    "description": "The motorcycle-riding lawmaker and cattle rancher was considered a maverick even before he abruptly switched to the Republican Party in March 1995.",
    "image": "https://www.politico.com/dims4/default/resize/1200/quality/90/format/jpg?url=https%3A%2F%2Fstatic.politico.com%2F5e%2F0a%2Fc4b5d6854af9a6815c309dff2cc4%2Fobit-ben-nighthorse-campbell-11839.jpg"
  },
  {
    "title": "Kennedy Center exodus: The 11 acts, creators pulling out amid Trump takeover - Axios",
    "description": "A jazz ensemble and a New York dance company this week joined those canceling their events at the Kennedy Center.",
    "image": "https://images.axios.com/xgJjDQBLJmp9QILqqyZduSg751E=/0x0:3463x1948/1366x768/2025/12/30/1767124457555.jpeg"
  },
  {
    "title": "Trump vetoes bipartisan bill to provide clean water to rural Southeastern Colorado - Colorado Public Radio",
    "description": "The legislation to complete the Arkansas Valley Conduit passed Congress with unanimous support but was branded an ‘expensive and unreliable’ project by the President.",
    "image": "https://wp-cpr.s3.amazonaws.com/uploads/2025/12/AVC-Construction-1-Cropped1.jpg"
  },
  {
    "title": "Trump administration says it's freezing child care funds to Minnesota after series of fraud schemes - AP News",
    "description": "The Trump administration has announced that it is freezing child care funds to Minnesota after a series of fraud schemes in recent years. Deputy Secretary of Health and Human Services Jim O’Neill said on the social platform X on Tuesday that the move is in re…",
    "image": "https://dims.apnews.com/dims4/default/a3333bf/2147483647/strip/true/crop/3200x1800+25+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2F88%2F049f27c385d6234dede9492a9aa3%2F7987537a8f1544bf804d348a71dbcad3"
  },
  {
    "title": "Gold and silver see rollercoaster end to blockbuster year - BBC",
    "description": "The price of gold soared by more than 60% this year to hit a record high of more than $4,549.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2238/live/88647ff0-e5e3-11f0-956e-47166c96f12f.jpg"
  },
  {
    "title": "Lucas: FSU Rapid Reactions - University of North Carolina Athletics",
    "description": "Quick takeaways from the ACC opener.",
    "image": "https://images.sidearmdev.com/resize?url=https%3A%2F%2Fdxbhsrqyrr690.cloudfront.net%2Fsidearm.nextgen.sites%2Func.sidearmsports.com%2Fimages%2F2025%2F12%2F30%2FEvans_Kyan.fsu.81.jpg&width=1600&type=jpeg"
  },
  {
    "title": "Guinea elections: Gen Mamady Doumbouya wins controversial election - BBC",
    "description": "The victory, which gives the junta leader a seven-year mandate, was widely expected.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6e4d/live/b3cc9db0-e4aa-11f0-86bc-7f4eee801597.jpg"
  }
]