[
  {
    "title": "Bay Area leaders decry Trump administration’s attack on Venezuela - San Francisco Chronicle",
    "description": "Bay Area leaders and protesters condemned the Trump administration Saturday for bombing Venezuela and capturing its leader, Nicolás Maduro.",
    "image": "https://s.hdnux.com/photos/01/55/52/11/28746314/3/rawImage.jpg"
  },
  {
    "title": "Pyongyang fires ballistic missiles as South Korean President Lee Jae Myung makes state visit to China - CNN",
    "description": "North Korea fired several ballistic missiles from its capital Pyongyang towards the sea off its east coast at around 7:50 a.m. local time on Sunday, South Korea’s military said.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/2025-12-29t001904z-1033476665-rc2xpianytie-rtrmadp-3-northkorea-missiles-1.jpg?c=16x9&q=w_800,c_fill"
  },
  {
    "title": "Live: Updates: Kickoff nears for Seahawks-49ers NFC West-deciding showdown - The Seattle Times",
    "description": "With the NFC West title on the line and behind a strong defensive showing so far, the Seahawks lead the 49ers 10-3 as the second half begins.",
    "image": "https://images.seattletimes.com/wp-content/uploads/2026/01/01032026_tzr1stQuarter_tzr_175040.jpg?d=1200x630"
  },
  {
    "title": "Rapid Reactions: Panthers fall to Bucs, division decided Sunday - Panthers.com",
    "description": "With both teams now 8-9, the division will be decided by the Falcons-Saints game Sunday, and the Panthers are hoping Atlanta can help.",
    "image": "https://static.clubs.nfl.com/image/upload/t_editorial_landscape_12_desktop/panthers/ltj2ax1lb2wu7yvo0qad"
  },
  {
    "title": "Leonardo DiCaprio to Miss Palm Springs Film Fest Gala Due to Venezuela Air Restrictions (EXCLUSIVE) - Variety",
    "description": "Leonardo DiCaprio will miss Saturday night's Palm Springs Film Festival Awards Gala amid the developing geopolitical situation in Venezuela.",
    "image": "https://variety.com/wp-content/uploads/2025/12/P1032V2O.jpg?crop=0px%2C55px%2C2000px%2C1125px&resize=1000%2C563"
  },
  {
    "title": "How UK plush toy Jellycat conquered China - BBC",
    "description": "The plushies bring \"emotional value\" to Chinese youth navigating economic uncertainty.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/df89/live/a8c28410-c106-11f0-801d-4586c230975c.jpg"
  },
  {
    "title": "Maduro overthrow in oil-rich Venezuela unlikely to shake energy markets in the near term - CNBC",
    "description": "While Venezuela has the world's largest oil reserves, its oil production is relatively small.",
    "image": "https://image.cnbcfm.com/api/v1/image/108038249-1727178681692-gettyimages-1250764851-eg_JBU_03042023_91055JPG.jpeg?v=1767476008&w=1920&h=1080"
  },
  {
    "title": "Iran's leader says rioters 'must be put in their place' as protest death toll rises to at least 10 - PBS",
    "description": "Iran's supreme leader insisted Saturday that “rioters must be put in their place” after a week of protests that have shaken the Islamic Republic, likely giving security forces a green light to aggressively put down the demonstrations.",
    "image": "https://d3i6fh83elv35t.cloudfront.net/static/2026/01/2026-01-03T124529Z_1253693610_RC2OTIATZXC7_RTRMADP_3_IRAN-ECONOMY-PROTESTS-GERMANY-1024x683.jpg"
  },
  {
    "title": "Measles exposure found in NC - WRAL",
    "description": "A person carrying measles traveled through Gaston County while infectious, according to the North Carolina Department of Health and Human Services.",
    "image": "https://images.wral.com/ee7a01e5-3838-5350-8c2f-5b0ab1a5ec86?w=1200&h=630"
  }
]