[
  {
    "title": "Golding, Ole Miss edge Georgia, will meet Miami - ESPN",
    "description": "With a field goal and a safety in the final minute of the fourth quarter, Ole Miss defeated Georgia 39-34 in the Sugar Bowl to advance to the College Football Playoff semifinals against Miami.",
    "image": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0102%2Fr1595760_1296x729_16%2D9.jpg"
  },
  {
    "title": "Woman killed in suspected mountain lion attack while hiking in northern Colorado - ABC News",
    "description": "A woman was killed in a suspected mountain lion attack while she was hiking alone in the mountains of northern Colorado",
    "image": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg"
  },
  {
    "title": "Tommy Lee Jones’ daughter found dead at San Francisco hotel, reports say - San Francisco Chronicle",
    "description": "Victoria Jones, the daughter of actor Tommy Lee Jones, was found dead at San Francisco’s Fairmont Hotel on New Year’s Day, according to reports.",
    "image": "https://s.hdnux.com/photos/01/55/51/40/28743720/3/rawImage.jpg"
  },
  {
    "title": "Japan PM joins fight for more female toilets in parliament - BBC",
    "description": "Japan's parliament building was built in 1936, a decade before women were given the right to vote.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e47f/live/d9123820-e782-11f0-8822-b112449c752c.jpg"
  },
  {
    "title": "Indiana throttles Alabama: Hoosiers leave no doubt en route to CFP semifinal berth vs. Oregon - CBS Sports",
    "description": "Indiana looked every bit the part of a No. 1 seed in a dominant victory over Alabama in the Rose Bowl College Football Playoff quarterfinal",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/01/11731c98-3e9c-4a7d-9adf-f95c7d058420/thumbnail/1200x675/7d1e614a2c58a8d133bd490574522459/indiana-lb-1.jpg"
  },
  {
    "title": "Catholic influencer's 5-year-old son dies after 11-day flu battle followed by thousands - Fox News",
    "description": "Paul J. Kim announced his 5-year-old son Micah died after severe flu that turned septic and caused seizures after an 11-day hospital battle documented on social media.",
    "image": "https://static.foxnews.com/foxnews.com/content/uploads/2025/10/young-boy-hospitalized-sepsis.jpg"
  },
  {
    "title": "5 takeaways from Trump's defiant WSJ interview on his health - Axios",
    "description": "Trump told the WSJ he had a CT scan during a recent medical exam and not an MRI scan, as he previously claimed.",
    "image": "https://images.axios.com/hJi804gyD51-4cOFCNFCKpyziKo=/0x0:6411x3606/1366x768/2026/01/01/1767307327893.jpeg"
  },
  {
    "title": "Will Smith sued over allegations he retaliated against violinist who reported sexual harassment - NBC News",
    "description": "A violinist accused Will Smith of retaliation after he said he was fired for reporting sexual harassment while on tour with the actor and rapper, according to a lawsuit filed earlier this week",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-01/260101-Will-Smith-aa-607-d8ab62.jpg"
  },
  {
    "title": "McGuire: TTU not using layoff as excuse for loss - ESPN",
    "description": "Texas Tech's Joey McGuire didn't use the team's layoff ahead of Thursday's game as an excuse, instead pointing to inefficient early-down execution and costly turnovers as the primary reasons for a loss to \"the best defense we've faced\" in Oregon.",
    "image": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0102%2Fr1595719_1296x729_16%2D9.jpg"
  },
  {
    "title": "Why everything from your phone to your PC may get pricier in 2026 - BBC",
    "description": "The price of Ram - once one of the cheapest computer parts - has more than doubled since October 2025.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f05a/live/c9053c70-e4c1-11f0-ae58-3d4c41eac55f.jpg"
  }
]